driver-tests/bpelse/compensation/NestedScopeJBI/test/DefaultCompensation_Rethrow/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:StrElem xmlns:ns1="http://xml.netbeans.org/schema/ScopesInterfaceSchema">Test Msg: :In Process: :S1 Start: :S2 Start: :S3 Start: :S3 End: :S2 End: :S1 Before fault: :S3CH called by Default FCH: :In Process FH:</ns1:StrElem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
