driver-tests/bpelse/compensation/NestedScopeJBI/test/results/DefaultCompensation_Rethrow/Actual_20130304130319_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <StrElem xmlns="http://xml.netbeans.org/schema/ScopesInterfaceSchema" xmlns:msgns="http://j2ee.netbeans.org/wsdl/ScopeInterface" xmlns:scop="http://xml.netbeans.org/schema/ScopesInterfaceSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">Test Msg: :In Process: :S1 Start: :S2 Start: :S3 Start: :S3 End: :S2 End: :S1 Before fault: :S3CH called by Default FCH: :In Process FH:</StrElem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>