driver-tests/bpelse/compensation/NestedScopeJBI/test/DefaultCompensation_Rethrow/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:scop="http://xml.netbeans.org/schema/ScopesInterfaceSchema">
  <soapenv:Body>
    <scop:StrElem>Test Msg:</scop:StrElem>
  </soapenv:Body>
</soapenv:Envelope>